scripts/pH_case/constant/momentumTransport.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*simulationType LES;
LES
{
  model  continuousGasKEqn;;
  turbulence  on;
  printCoeff  on;

  delta       cubeRootVol;

    cubeRootVolCoeffs
    {
    }
    }*/

simulationType RAS;
RAS
{
  model  mixtureKEpsilon;
  turbulence  on;
  printCoeff  on;
  }

// ************************************************************************* //
